<template>
  <div class="main-page">
    <div class="common-panel">
      <div class="common-panel-top">
        <div class="common-panel-top-btns left">
          <v-btn depressed title="뒤로가기" color="transparent">
            <v-icon class="icon-history-back"></v-icon>
          </v-btn>
        </div>
        <h1>
          <v-img contain src="/src/assets/images/logo_raemian_white.svg"></v-img>
        </h1>
      </div>
      <div class="common-panel-body">
        <div class="common-panel-title">
          <h2>공지사항</h2>
        </div>
        <div class="common-panel-content">
          <div class="board-wrap" :class="{hasDetail:detailViewMode}">
            <div class="board-list">
              <v-list-item-group v-model="activeItem">
                <v-list-item
                  v-for="(item, index) in items"
                  @click.stop="viewDetail(index)"
                  :key="index"
                >
                  <v-list-item-title>
                    <span class="title">{{item.title}}</span>
                    <span class="date">{{item.date}}</span>
                  </v-list-item-title>
                </v-list-item>
              </v-list-item-group>
            </div>
            <div class="board-detail" v-if="detailViewMode==true" v-html="this.detailText"></div>
          </div>
        </div>
        <v-btn color="transparent" depressed class="btn-common-panel-close">
          <v-img src="/src/assets/images/ic_exit.svg"></v-img>
        </v-btn>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: "notice",
  watch: {},
  data: () => ({
    detailViewMode: true, //상세보기 유/무
    detailText: "",
    activeItem: "",
    items: [
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "<strong>1. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다.</strong><br> <strong>* 운영시간 :</strong> 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지)<br> <strong>* 실시 일자 :</strong> 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) <br><strong>* 주의 사항</strong><br> - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "2. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "3. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      },
      {
        title: "소방시설 점검 안내",
        date: "2020-03-20",
        content:
          "4. 아파트 중앙 분수대 작동 시간 및 이용에 대한 안내드립니다. * 운영시간 : 평일(오후 3시~오후 9시까지) 주말,공휴일(오전9시~오후9시까지) * 실시 일자 : 2014년 7월 5일 토요일부터 8월 31일까지 (55일간) * 주의 사항 - 자전거 등을 가지고 분수대 안으로 들어가는 것은 매우 위험합 니다. 이로 인하여 생기는 병이나 사고는 전적으로 입주자의 과실임을 알려 드립니다."
      }
    ]
  }),
  computed: {},
  mounted() {},
  methods: {
    viewDetail: function(index) {
      var contentText = this.items[index]["content"];
      console.log(contentText);
      this.detailText = contentText;
    }
  },
  components: {}
};
</script>